braspag/templates/authorize.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <AuthorizeTransaction xmlns="https://www.pagador.com.br/webservice/pagador">
      <request>

        <RequestId>{{ request_id }}</RequestId>
        <Version>1.0</Version>
        
        {% block request %}
        <OrderData>
          <MerchantId>{{ merchant_id }}</MerchantId>
          <OrderId>{{ order_id }}</OrderId>
          {% if braspag_orderid %}
            <BraspagOrderId>{{ braspag_orderid }}</BraspagOrderId>
          {% else %}
            <BraspagOrderId xsi:nil="true" />
          {% endif %}
        </OrderData>

        <CustomerData>
          <CustomerIdentity>{{ customer_id }}</CustomerIdentity>
          <CustomerName>{{ customer_name }}</CustomerName>
          <CustomerEmail>{{ customer_email }}</CustomerEmail>
          {% if customer_address %}
            <CustomerAddressData>
                <Street>{{ customer_address.street }}</Street>
                <Number>{{ customer_address.number }}</Number>
                {% if customer_address.complement %}
                  <Complement>{{ customer_address.complement }}</Complement>
                {% else %}
                  <Complement xsi:nil="true"/>
                {% endif %}
                <District>{{ customer_address.district }}</District>
                <ZipCode>{{ customer_address.zipcode }}</ZipCode>
            </CustomerAddressData>
          {% else %}
            <CustomerAddressData xsi:nil="true" />
          {% endif %}
          {% if delivery_address %}
            <DeliveryAddressData>
                <Street>{{ delivery_address.street }}</Street>
                <Number>{{ delivery_address.number }} </Number>
                {% if delivery_address.complement %}
                  <Complement>{{ delivery_address.complement }}</Complement>
                {% else %}
                  <Complement xsi:nil="true"/>
                {% endif %}
                <District>{{ delivery_address.district }}</District>
                <ZipCode>{{ delivery_address.zipcode }}</ZipCode>
            </DeliveryAddressData>
          {% else %}
            <DeliveryAddressData xsi:nil="true" />
          {% endif %}
        </CustomerData>

        <PaymentDataCollection>
          <PaymentDataRequest xsi:type="CreditCardDataRequest">
            <PaymentMethod>{{ payment_method }}</PaymentMethod>
            <Amount>{{ amount }}</Amount>
            <Currency>{{ currency }}</Currency>
            <Country>{{ country }}</Country>
            <NumberOfPayments>{{ number_of_payments }}</NumberOfPayments>
            <PaymentPlan>{{ payment_plan }}</PaymentPlan>
            <TransactionType>{{ transaction_type }}</TransactionType>

            {% if card_number %}
              <CardHolder>{{ card_holder }}</CardHolder>
              <CardNumber>{{ card_number }}</CardNumber>
              <CardSecurityCode>{{ card_security_code }}</CardSecurityCode>
              <CardExpirationDate>{{ card_exp_date }}</CardExpirationDate>
              {% if save_card %}
                 <SaveCreditCard>{{ save_card }}</SaveCreditCard>
              {% endif %}
            {% endif %}

            {% if card_token %}
               <CreditCardToken>{{ card_token }}</CreditCardToken>
            {% endif %}

            <AdditionalDataCollection xsi:nil="true" />
          </PaymentDataRequest>
        </PaymentDataCollection>
        {% endblock %}
      </request>
    </AuthorizeTransaction>
  </soap:Body>
</soap:Envelope>
